import { useState, useEffect } from 'react';
import { motion } from 'framer-motion';
import Audio1 from '../assets/audio/Page6.mp3'

function Page6() {
  // Define the page data, which includes multiple images
  const pageData = {
    title: 'पोर्तुगीज-इंग्रज-सिद्धि यांचा कुलाब्यावर संयुक्तपणे हल्ला',
    description: '१६७० मध्ये इंग्रज आणि पोर्तुगीज सेनेच्या संयुक्तपणाने कुलाब्यावर सिद्धींचा हल्ला केला.',
    images: [
      'https://kreately.in/wp-content/uploads/2020/10/Screenshot-201.png',  // Add more images as needed
    ],
    audioUrl: Audio1,
    fullInfo: `आंग्ग्रांचे आरमारी वर्चस्व पोर्तुगीज व इंग्रजांना अगदी नकोसे झाले होते. त्यामुळे दोघांनी आंग्ग्रांचा समूळ नाश करण्यासाठी परस्परात ऑगस्ट १७२१ मध्ये करार केला. आंग्ग्रांचा नाश केल्यावर कुलाबा पोर्तुगिजांनी वविजयदुर्ग इंग्रजांनी घ्यावा असे ठरले. आलेले संकट ओळखून कान्होजीने सुद्धा जय्यत तयारी केली होती. शत्रूची खडान्खडा माहिती जमविण्याचे धोरण कान्होजींचे होते. ते आपल्या शत्रूवर बारीक लक्ष ठेवून होते. इंग्रजांना पोर्तुगिजांपासून फोडण्याचा प्रयत्न केला. त्यात यश न आल्याने कुलाबा किल्ला भरपूर रसद, एक हजार पायदळ व सातशे घोडेस्वारांनी सज्ज ठेवला.

कान्होजींच्या कुलाब्यावर कोठून यशस्वी हल्ला करता येईल, याची पहाणी करण्यासाठी पोर्तुगीज जनरल डॉन अॅटोनिओ डी. केस्टो, इ. मेलो, कमोडर मॅधूज व इंग्लिश आरमारातील लेफ्टनंट कर्नल कोव्हेन कुलाबा किल्ल्याच्या सभोवतीच्या प्रदेशाची पाहणी करत होते. इतक्यात निवडुंगाच्या आडोशाने आंग्ग्रांचा एक घोडेस्वार पहाणी पथकाच्या अगदी जवळ आला. अचूक भालाफेक करून त्याने कमोडर थॉमस मॅथूजच्या मांडीला जखम करून क्षणात नाहिसा झाला. या अचानक हल्ल्याने पहाणी पथकाची गाळण उडाली. अशाच तन्हेने धाडसी हल्ले करत राहून कान्होजींनी संयुक्त सैन्यास सतत सतावण्याचे आपले धोरण चालू ठेवले. पोर्तुगीज व्हिसेरेइ फ्रान्सिश्कु झुजै सांपायु इ. काश्त्रू हे जातीने युद्धाची पहाणी करायला हजर होते. इंग्रज व पोर्तुगीज फौजा अरळीजवळ ठाण मांडून बसल्या. या संयुक्त स्वारीच्यावेळी छत्रपती शाहूंनी संकट ओळखून कान्होजीच्या मदतीसाठी पिलाजी जाधव यांस १००० पायदळ व १५०० घोडेस्वारांसह पाठवून दिले.

संयुक्त सैन्याच्या हल्ल्यास १३ डिसेंबर १७२१ ला सुरुवात झाली. कुलाबा किल्ल्याचे दरवाजे फोडून आत प्रवेश करणे सैन्याला अवघड जात होते. कान्होजीच्या युद्धकौशल्याचे कसब म्हणजे पोर्तुगीज व इंग्रज यांच्या सैन्याला त्यांनी कधी एकत्र येण्याची संधी दिली नाही. त्यामुळे दोन्ही सैन्ये वेगवेगळ्या प्रकारे कुलाबा किल्ल्यावर हल्ला करत. कान्होजी त्यांच्याशी एकामागून एक युद्ध करत होते. कुलाब्यानजीक उभ्या असलेल्या पोर्तुगीज सैन्याला पिलाजी जाधवांच्या सैन्याने सर्व बाजूंनी घेरले व त्यांचा नाश केला.

पोर्तुगिजांनी आरळीपर्यंत माघार घेतली. इकडे इंग्रजांच्या ५०० सैनिकांनी जनरल ब्रेथवेट व कोव्हेनच्या नेतृत्वाखाली कुलाब्यावर हल्ला केला. कुलाबा किल्ल्यास इंग्रजांनी शिड्या लावून चढण्याचा प्रयत्न केला परंतु त्यांना त्यात यश आले नाही. इंग्रजांच्या शिड्या लहान व किल्ल्याचा कुलाब्यावर पोर्तुगीज-इंग्रज संयुक्त हल्ला, १७२१

तट उंच होता. लगेच इंग्रजांनी कुलाब्याचा मुख्य दरवाजा फोडण्याची खटपट केली. कान्होजींच्या सैनिकांनी इंग्रजांची दाणादाण उडवून दिली.

पोर्तुगीज आपल्या मदतीला येतील अशी आशा इंग्रजांना होती. पण बाजीराव पेशवा ७०० स्वारानिशी कान्होजीस येऊन मिळाला. तेव्हा विजयाची आशा सोडून इंग्रजांनी तहाची बोलणी सुरू केली. इंग्रजांचे सांगणे होते की संयुक्त सेनेच्या अधिकाऱ्यांना तहास बोलवावे.

कान्होजींनी पोर्तुगीजांशी स्वतंत्र बोलणी सुरू केल्यावर इंग्रज पळून गेले. इंग्रजांचा सर्व दारुगोळा तोफांसकट कान्होजींच्या हाती लागला. कान्होजींनी संयुक्त सैन्याच्या या पराभवाचा भरपूर फायदा उठविण्याचे ठरवले. या लढाईचा पोर्तुगिजांनी इतका धाक घेतला की कान्होजीच्या परत वाटेला न जाण्याचे त्यांनी लेखी कबूल केले. पोर्तुगिजांना कान्होजींनी रेवदंड्यास पाठवून दिले. त्यामुळे इंग्रज एकटे पडले. इंग्रजांना पोर्तुगिजांच्या कृत्याची चीड आली. आपल्या पराभवास पोर्तुगीजच जबाबदार आहेत असे त्यांनी पोर्तुगीज गव्हर्नरला कळवले. त्यानंतर मात्र इंग्रज व पोर्तुगीज कान्होजीच्या हयातीत त्यांच्या वाट्यास कधी गेले नाहीत. या पराभवाचा फटका गव्हर्नर बूनला लगोलग बसला. त्याला निराश अवस्थेत इंग्लंडला परतावे लागले.इंग्रजांच्या सर्व एकापाठोपाठ एक आखलेल्या मोहिमांचा खर्च अतोनात झाला. त्याचबरोबर आपली जहाजे कान्होजीच्या हाती लागू नयेत म्हणून वाढवलेल्या संरक्षणानेही खर्चात वाढ झाली. इंग्रजांची जहाजे काफिल्याने पश्चिम किनाऱ्यावर ये-जा करू लागली. लढायांत झालेला खर्च भरून काढण्यासाठी मुंबई व सुरतेत उतरणाऱ्या मालावर दर टनाला एक रुपया जादा कर बसवण्यात आला.

कान्होजींवर इंग्रजांचा मुळीच विश्वास उरला नाही. कान्होजींच्या सर्व हालचाली इंग्रज डोळ्यात तेल घालून बघत होते. मुंबई, वरळी व वांद्रे, माहिम येथे कधीही हल्ला होईल या भीतीने सज्जता ठेवण्यात आली होती. मुंबईच्या बचावासाठी सिद्दीशी इंग्रजांनी सख्य केले होते. परंतु इंग्रजांचा पोर्तुगिजांवरचा विश्वास मात्र पूर्ण उडाला होता. इंग्रजांच्या हलाखीच्या परिस्थितीने पोर्तुगीज मात्र मनातून सुखावले होते.

इ.स. १७२४ मध्ये आंग्ग्रांनी परवान्याच्या सबबीवरून डच जहाजे जप्त केली. त्यामुळे इंग्रजांप्रमाणे डच आरमाराने विजयदुर्गावर हल्ला केला, अशा प्रकारे डच आरमाराची आंग्ग्रांबरोबर गाठ पडली. त्याचवेळी डच आरमारात सात युद्धनौका व २ मारगिऱ्या होत्या. विजयदुर्गाच्या हल्ल्यामध्ये डचांनाही माघार घ्यावी लागली. इंग्रजांप्रमाणे डचांनाही कान्होजीच्या समर्थ आरमारासमोर पाडाव लागला नाही. 

हे सर्व संघर्ष मोठे होते. त्याशिवाय पश्चिम किनाऱ्याचे सरखेल म्हणून आंग्ग्रांनी केलेल्या छोट्या कारवाया पुढे नमूद केल्या आहेत. त्यावरून असे लक्षात येईल की पश्चिम किनाऱ्याचे संरक्षक म्हणून आंग्रे यांचे अस्तित्व सर्वांना सतत जाणवत होते. |

जून १७२० मध्ये सुरतचे एक जहाज आंग्ग्रांनी चोवीस तास लढाई देऊन पकडले. त्याच साली इंग्रज व पोर्तुगिजांनी आंग्ग्रांची जहाजे पकडल्याचा बहाणा केला. प्रत्यक्षात मात्र आंग्ग्रांनीच इंग्रजांचे 'चार्लेट' हे जहाज पकडले. याच वर्षात दलाल फ्रामजीने नमूद केले आहे की जंजिरेकर सिद्दीच्या सांगण्यावरून आंग्ग्रांनी सुरतेच्या सय्यदची मालासकट पकडलेली जहाजे सोडून दिली.

१२६ फेब्रुवारी १७२१ आंग्ग्रांची ४ जहाजे व इंग्रजांची २ लढाऊ गलबते वसईजवळ एकमेकांसमोर आली. या झटापटीत इंग्रजांचा जयजवळजवळ निश्चित झालेला असताना त्यांच्या जवळील दारुगोळा संपला, तेव्हा नाइलाजाने त्यांना आपला जीव कसाबसा वाचवत पळ काढावा लागला. (21 १७२२ मध्ये 'व्हिक्टोरिया' व ५ नोव्हेंबर १७२ 'रिव्हेंज' या जहाजांनी आंग्ग्राचे एक जहाज, एक सुभेदार व ९० शिपाई पकडले. बाकीचे शिपाई मात्र राजापूर नदीकडे पळून जाण्यात यशस्वी झाले.)

५ । इ.स.१७२६ मध्ये कान्होजी आंग्रे यांनी सिद्दीबरोबर पालगड घेण्यासाठी युद्ध केले. असा उल्लेख मिळतो. इ.स.१७२७ मध्ये कान्होजी आंग्रेनी इंग्रजांचे 'डर्बी' नावाचे जहाज लुटले. 

। कॅप्टन कैबेलच्या जहाजावरील तांडेल व खलाशांनी खालील हकीकत कंपनीला कळवली होती की, त्यांचे जहाज दाभोळ बंदराजवळ असताना आंग्ग्रांची ४ गुराबे व १० गलबते त्यांच्या जहाजाच्या लांगीच्या दिशेने आली व इंग्रजांच्या जहाजावर हल्ला केला. वारा पडला होता त्यामुळे इंग्रजांचे जहाज आंग्ग्रांच्या हल्ल्यातून निसटू शकले नाही. आंख्यांनी आपल्या सैनिकांच्या सहाय्याने जहाजावर चढून जहाज घेरियास (विजयदुर्ग) नेले. बरेचजण कैद झाले त्यातून वाचलेल्या सैनिकांनी वृत्त मुंबईस कळवले.

महमद अली या व्यापाऱ्याचा 'जाफर बाकर' हा बतेला आणखी एका जहाजासकट आंग्ग्रांना धरून नेला. परंतु दुसऱ्या जहाजाने दस्तक दिला आहे हे लक्षात येताच त्या जहाजाची आंग्ग्रांनी सुटका केली. पुढे मानकचंद ह्यांच्या मध्यस्थीनंतर 'जाफर बाकर' हा बतेलाही कान्होजीनी सोडला. महमद अलीस त्यासाठी १५,000 रुपये इतकी रक्कम आंग्ग्रांना द्यावी लागली. महमद अलीने जो दंड भरला तो जहाजावरील मालाच्या किंमतीच्या निम्मा होता.

या संघर्षामुळे मोंगल, इंग्रज, पोर्तुगीज व सिद्दी यांना जागेपणी अगर स्वप्नात एकच ध्यास होता तो म्हणजे 'कान्होजीचा नाश कसा करावा ?' मग त्यासाठी एकमेकांशी तह, पत्रव्यवहार होत. नव्यानव्या योजना आखल्या जात.

सुरतेचे सुभेदार शेख इस्तमखान यांचे म्हणणे होते की, जमिनीवरून ३ ते ४ हजार सैनिक व सागरावरून जंजिऱ्याच्या सिद्दीच्या मदतीने इंग्रजांनी कान्होजींवर एकाचवेळी हल्ला करावा. अशाच आशयाची सूचना इ.स.१७१७ मध्ये सुभेदार हैदर कुलिखान यांनी केली होती. सैन्य दख्खनच्या नबाबाच्या हुकमतीखाली असावे असे त्यांनी म्हटले होते. सिद्दीलाही मोंगल बादशहाने फर्मान काढले होते. परंतु सिद्दीने स्वतः लढण्याची असमर्थता दर्शवली. सिद्दी जर फर्मानाला दाद देत नसेल तर सिद्दीची जहागीर बादशहाने काढून घ्यावी असेही सुरतेच्या सुभेदाराने सुचवले होते. प्रत्यक्षात कृती करण्यासाठी कोणीही पुढे येण्यास धजावत नव्हते. हे वरील उल्लेखावरून स्पष्ट होते.

गव्हर्नर बूनच्या काळात गाजलेले 'रामा कामाठी' प्रकरण पुढे सविस्तरपणे नमूद केले आहे. त्याचा गवगवा व उपयोग गव्हर्नरनी स्वतःच्या अपयशावर पांघरूण घालण्यासाठी केला हे नंतरच्या पुराव्यांनी स्पष्ट होईल. खटला चालू असतानाही गव्हर्नर कान्होजींशी व्यवहार करतच होते हे उपलब्ध कागदपत्रांवरून दिसून येते. अर्थात गव्हर्नरचे पितळ उघडे पडून त्याला मायदेशी परतावे लागले.`
  };

  const [audio, setAudio] = useState<HTMLAudioElement | null>(null);
  const [isPlaying, setIsPlaying] = useState(false);
  const [currentImageIndex, setCurrentImageIndex] = useState(0);  // Start with the first image

  useEffect(() => {
    // Automatically change the image every 5 seconds
    const imageInterval = setInterval(() => {
      setCurrentImageIndex((prevIndex) => (prevIndex + 1) % pageData.images.length);
    }, 5000); // 5000ms = 5 seconds

    return () => {
      clearInterval(imageInterval);  // Cleanup the interval on unmount
    };
  }, []);  // Empty dependency array to run only once on component mount

  useEffect(() => {
    return () => {
      if (audio) {
        audio.pause();
      }
    };
  }, [audio]);

  const handleAudioPlayback = () => {
  if (!pageData.audioUrl) return;

  if (audio) {
    audio.pause();
    setIsPlaying(false);
    setAudio(null);
  } else {
    const newAudio = new Audio(pageData.audioUrl);
    newAudio.play().then(() => setIsPlaying(true)).catch(err => console.log("Playback failed:", err));
    newAudio.addEventListener('ended', () => setIsPlaying(false));
    setAudio(newAudio);
  }
};

  return (
    <div className="max-w-1/2 mx-auto px-4 py-10 text-center bg-[#FAF3E0] min-h-screen flex flex-col items-center">
      
      <motion.h1 
        initial={{ opacity: 0, y: -20 }} 
        animate={{ opacity: 1, y: 0 }}
        className="text-xl font-medieval font-bold text-royal-800 mb-4"

      >
        {pageData.title}
      </motion.h1>
      
      <div>
        <p className="text-xs text-royal-500 font-serif">{pageData.description}</p>      </div>
      
      <motion.img 
        src={pageData.images[currentImageIndex]}  // Display the current image from the array
        alt={pageData.title} 
        className="w-full max-w-sm h-64 object-cover rounded-lg border-4 border-[#A67B5B] shadow-lg mt-4" 
        initial={{ opacity: 0 }} 
        animate={{ opacity: 1 }}
        transition={{ duration: 0.5 }}
      />
      
      {pageData.audioUrl && (
        <button 
          onClick={handleAudioPlayback} 
          className="mt-4 bg-[#8B4513] text-white px-5 py-2 rounded-lg hover:bg-[#704214] transition shadow-md text-md w-10/12 max-w-xs font-serif"
        >
          {isPlaying ? 'Stop Audio' : 'Play Audio Book'}
        </button>
      )}
      
      <div className="mt-6 text-left px-3 max-w-lg bg-royal-100 p-3 rounded-lg border-4 border-[#A67B5B] shadow-lg">
        <h2 className="text-lg font-semibold text-[#8B4513] mb-3 text-center font-serif">संपूर्ण माहिती</h2>
        <p className="text-[#5C4033] leading-tight text-justify text-[0.6rem] font-serif whitespace-pre-line">{pageData.fullInfo}</p>
      </div>
    </div>
  );
}

export default Page6;
